artillery/load-test.yml
config:
  target: "http://localhost:3000" # URL do servidor que será testado
  phases:
    - duration: 60 # Duração do teste em segundos
      arrivalRate: 20 # Número de requisições por segundo
  payload:
    # Arquivo opcional para variáveis de teste (opcional para endpoints dinâmicos)
    # file: "data.csv"
    # fields: ["name"]

scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/hello/JohnDoe"
      - get:
          url: "/greet?name=Jane"
      - get:
          url: "/sum"
      - get:
          url: "/duplicate-sum"
      - get:
          url: "/xss"
      - get:
          url: "/admin?admin=true"
      - get:
          url: "/exec"
          qs:
            code: "1+1" # Simula um código seguro para execução
      - get:
          url: "/memory-issue"